openfoam/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS; // Using Reynolds Averaged Navier Stokes equations, thus modelling the reynolds averaged stresses.

RAS
{
    RASModel        kOmegaSST; // Using k-Epsilon turbulence model

    turbulence      on; // Turbulence activated

    printCoeffs     on; // Printing turbulence coefficients
}

// ************************************************************************* //
